% розмір зображення і кордони області

N = 600;	% розмір зображення в пікселях
xmin = -2;	 
xmax = 1;	% кордони області яку будемо відображати
ymin = -1.5;
ymax = 1.5;

% матриця пікселей

[X, Y] = meshgrid(linspace(xmin, xmax, N), linspace(ymin, ymax,N));	% створюємо дві матриці X та Y в які поміщаємо координати
A = X + 1i*Y;		% Створюємо масив який являється комплексним числом і складається з координат X та Y

% ітеріруємо точки перебором

C = A;  		% Перебираємо кожну точку матриці A, кожне комплексне число в матриці взводимо в квадрат
for k = 1:50		% і додаємо комплексне число з початкового значення яке рівняється A на першій ітерації
   A = A.^2 + C;	% цикл повторюємо 50 разів, в результаті на кожній ітерації отримуємо нове комплексне число
end			% для кожної точки в матриці A


% оприділяємо множество

M = (abs(A) < 2);		% Якщо абсолютно значення (abs) комплексного числа менше двох, то точка находиться в множині

% виводимо результат

colormap(spring);
imagesc(M);
axis equal;
waitforbuttonpress;
